{"config": [{"config": {"dropout": 0.0, "init": "uniform", "W_constraint": null, "name": "embedding_1", "input_length": 56, "batch_input_shape": [null, 56], "trainable": true, "input_dtype": "int32", "output_dim": 20, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "input_dim": 20672}, "class_name": "Embedding"}, {"config": {"trainable": true, "p": 0.7, "batch_input_shape": [null, 56, 20], "input_dtype": "float32", "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 56, 20], "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"nb_filter": 3, "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "filter_length": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution1d_1", "bias": true, "activation": "relu", "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_1"}, {"config": {"nb_filter": 3, "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "filter_length": 4, "b_regularizer": null, "b_constraint": null, "name": "convolution1d_2", "bias": true, "activation": "relu", "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_2"}, {"config": {"trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2, "name": "maxpooling1d_1"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "maxpooling1d_1"}, {"config": {"trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2, "name": "maxpooling1d_2"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "maxpooling1d_2"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "flatten_1"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "flatten_2"}, {"config": {"mode": "concat", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_shape": null, "output_mask": null, "name": "merge_1", "mode_type": "raw", "concat_axis": -1}, "class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0]]], "name": "merge_1"}], "output_layers": [["merge_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "output_dim": 100, "trainable": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.8, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "output_dim": 1, "trainable": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.2"}