{"keras_version": "1.1.2", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 50], "W_regularizer": null, "init": "uniform", "dropout": 0.0, "trainable": true, "W_constraint": null, "input_dtype": "int32", "output_dim": 20, "activity_regularizer": null, "name": "embedding_1", "input_length": 50, "input_dim": 20672}}, {"class_name": "Dropout", "config": {"input_dtype": "float32", "batch_input_shape": [null, 50, 20], "name": "dropout_1", "trainable": true, "p": 0.7}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 50, 20]}, "name": "input_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"bias": true, "W_regularizer": null, "subsample_length": 1, "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 3, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_1", "input_length": null, "activation": "relu", "filter_length": 3, "input_dim": null, "border_mode": "valid"}, "name": "convolution1d_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"bias": true, "W_regularizer": null, "subsample_length": 1, "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 3, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_2", "input_length": null, "activation": "relu", "filter_length": 4, "input_dim": null, "border_mode": "valid"}, "name": "convolution1d_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_1", 0, 0]]], "config": {"pool_length": 2, "border_mode": "valid", "name": "maxpooling1d_1", "stride": 2, "trainable": true}, "name": "maxpooling1d_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_2", 0, 0]]], "config": {"pool_length": 2, "border_mode": "valid", "name": "maxpooling1d_2", "stride": 2, "trainable": true}, "name": "maxpooling1d_2"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "config": {"name": "flatten_2", "trainable": true}, "name": "flatten_2"}, {"class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0]]], "config": {"output_mask": null, "concat_axis": -1, "mode": "concat", "arguments": {}, "name": "merge_1", "output_mask_type": "raw", "output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "dot_axes": -1}, "name": "merge_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["merge_1", 0, 0]]}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 100, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.8, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "name": "dense_2", "activation": "linear", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "sigmoid"}}], "class_name": "Sequential"}